docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-08 Wed 20:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Independent Study in Computer Science - Formal Verification</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Independent Study in Computer Science - Formal Verification</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc78e31b">1. Information</a></li>
<li><a href="#org7b8b3cf">2. Evaluation</a></li>
<li><a href="#org11c3218">3. Learning Objectives</a></li>
<li><a href="#org5f9df4b">4. Resources</a></li>
<li><a href="#org254c1a5">5. Topics Bucket</a></li>
<li><a href="#orgd25e76b">6. Schedule</a></li>
<li><a href="#org506bd62">7. Directory</a></li>
<li><a href="#orge87de75">8. Health and Wellbeing</a></li>
<li><a href="#org4114446">9. Documentation</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc78e31b" class="outline-2">
<h2 id="orgc78e31b"><span class="section-number-2">1.</span> Information</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0bd8ec9" class="outline-4">
<h4 id="org0bd8ec9">Advisor: Giselle Reis (greis)</h4>
</div>
<div id="outline-container-org95f9388" class="outline-4">
<h4 id="org95f9388">Student: Louis Quilling (equillin)</h4>
</div>
<div id="outline-container-orgecf3b85" class="outline-4">
<h4 id="orgecf3b85">Units: 3/6/9/12</h4>
</div>
<div id="outline-container-org441b85a" class="outline-4">
<h4 id="org441b85a">Meets every Monday (except when noted) at ROOM <span class="underline">_</span>, at TIME <span class="underline">__</span>.</h4>
</div>
<div id="outline-container-orgcb5f7d0" class="outline-4">
<h4 id="orgcb5f7d0">Runs for not more than 17 weeks.</h4>
</div>
</div>
<div id="outline-container-org7b8b3cf" class="outline-2">
<h2 id="org7b8b3cf"><span class="section-number-2">2.</span> Evaluation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1f2f08f" class="outline-3">
<h3 id="org1f2f08f"><span class="section-number-3">2.1.</span> Comprehension <code>[60%]</code></h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orge6ffa6a" class="outline-4">
<h4 id="orge6ffa6a">Read the assigned chapter by the weekly meeting.</h4>
</div>
<div id="outline-container-org3a67bef" class="outline-4">
<h4 id="org3a67bef">Create structured notes for concepts covered by the weekly meeting.</h4>
</div>
<div id="outline-container-org1d9d9c9" class="outline-4">
<h4 id="org1d9d9c9">Attend the weekly meeting with the professor to discuss the chapter.</h4>
</div>
<div id="outline-container-org137576c" class="outline-4">
<h4 id="org137576c">Reflect metacognitively about course progress and learning strategies and broader connections for each week.</h4>
</div>
</div>
<div id="outline-container-org1f39239" class="outline-3">
<h3 id="org1f39239"><span class="section-number-3">2.2.</span> Application <code>[40%]</code></h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org836933a" class="outline-4">
<h4 id="org836933a">There are numerous book exercises. The goal is to complete a reasonable amount of exercises per chapter. There are &ldquo;easy&rdquo;, &ldquo;medium&rdquo;, &ldquo;hard&rdquo; problems &#x2013; the student/teacher will set what &ldquo;reasonable&rdquo; means as the course progresses.</h4>
</div>
<div id="outline-container-org8bd67fd" class="outline-4">
<h4 id="org8bd67fd">The student will aim to produce a verification of a program or mathematical theorem, but this is optional.</h4>
</div>
</div>
</div>
<div id="outline-container-org11c3218" class="outline-2">
<h2 id="org11c3218"><span class="section-number-2">3.</span> Learning Objectives</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga44fa95" class="outline-4">
<h4 id="orga44fa95">Learn to use the Coq Proof Assistant for mathematical assertions, mechanical checking, formal proofs, and extraction of certified programs.</h4>
</div>
<div id="outline-container-org0a7aa63" class="outline-4">
<h4 id="org0a7aa63">Learn mathematical underpinnings of computer-assisted theorem proving, functional programming, operational semantics.</h4>
</div>
<div id="outline-container-org67faf62" class="outline-4">
<h4 id="org67faf62">Learn to formally verify functional data structures/algorithms such as trees, maps, ordering, sorts, etc.</h4>
</div>
<div id="outline-container-org9364c03" class="outline-4">
<h4 id="org9364c03">Learn to effectively communicate formal methods concepts.</h4>
</div>
<div id="outline-container-org384a6a2" class="outline-4">
<h4 id="org384a6a2">Build strong habits and a decent familiarity for further in-depth study or research in formal methods.</h4>
</div>
</div>
<div id="outline-container-org5f9df4b" class="outline-2">
<h2 id="org5f9df4b"><span class="section-number-2">4.</span> Resources</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgbeaf68b" class="outline-3">
<h3 id="orgbeaf68b"><span class="section-number-3">4.1.</span> Book <a href="https://softwarefoundations.cis.upenn.edu/">https://softwarefoundations.cis.upenn.edu/</a></h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgb2bf4e3" class="outline-4">
<h4 id="orgb2bf4e3">[./lf] - Logical Foundations</h4>
</div>
<div id="outline-container-org1974814" class="outline-4">
<h4 id="org1974814">[./plf] - Programming Language Foundations</h4>
</div>
<div id="outline-container-orgeaa480a" class="outline-4">
<h4 id="orgeaa480a">[./vfa] - Verifiable Functional Algorithms</h4>
</div>
</div>
<div id="outline-container-org48f428c" class="outline-3">
<h3 id="org48f428c"><span class="section-number-3">4.2.</span> Video lectures</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orga116d49" class="outline-4">
<h4 id="orga116d49"><a href="https://deepspec.org/event/dsss18">https://deepspec.org/event/dsss18</a></h4>
</div>
</div>
<div id="outline-container-orgc276e73" class="outline-3">
<h3 id="orgc276e73"><span class="section-number-3">4.3.</span> Other articles</h3>
</div>
</div>
<div id="outline-container-org254c1a5" class="outline-2">
<h2 id="org254c1a5"><span class="section-number-2">5.</span> Topics Bucket</h2>
<div class="outline-text-2" id="text-5">
<p>
There are 17 weeks (even counting breaks) before the end of the semester.
</p>

<p>
There are 30 chapters I identified preliminarily (without thorough inspection), topics will be chosen from here per student interest, professor discretion,  or when subsequent chapters require one as a prerequisite.
</p>

<p>
There is a suggested schedule.
</p>
</div>
<div id="outline-container-orga7d3453" class="outline-3">
<h3 id="orga7d3453"><span class="section-number-3">5.1.</span> Logical Foundations (of Program Verification)</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org4b09f0a" class="outline-4">
<h4 id="org4b09f0a">Basics of Coq</h4>
</div>
<div id="outline-container-org12654a2" class="outline-4">
<h4 id="org12654a2">Proof by Induction</h4>
</div>

<div id="outline-container-org90c61b1" class="outline-4">
<h4 id="org90c61b1">Working with Structured Data</h4>
</div>

<div id="outline-container-org03d6dab" class="outline-4">
<h4 id="org03d6dab">Polymorphism and Higher-Order Functions</h4>
</div>

<div id="outline-container-org57468f8" class="outline-4">
<h4 id="org57468f8">Logic in Coq</h4>
</div>

<div id="outline-container-orgf13cd84" class="outline-4">
<h4 id="orgf13cd84">Inductively defined propositions</h4>
</div>

<div id="outline-container-org616a27b" class="outline-4">
<h4 id="org616a27b">Proof Objects</h4>
</div>

<div id="outline-container-org8fd917a" class="outline-4">
<h4 id="org8fd917a">Relations</h4>
</div>

<div id="outline-container-orgd2b537e" class="outline-4">
<h4 id="orgd2b537e">Maps</h4>
</div>

<div id="outline-container-org086ec50" class="outline-4">
<h4 id="org086ec50">Imp</h4>
</div>

<div id="outline-container-orgbd8ff7a" class="outline-4">
<h4 id="orgbd8ff7a">ImpParser</h4>
</div>

<div id="outline-container-org73a3823" class="outline-4">
<h4 id="org73a3823">Extraction</h4>
</div>

<div id="outline-container-org561296f" class="outline-4">
<h4 id="org561296f">Auto</h4>
</div>
</div>
<div id="outline-container-org82ee495" class="outline-3">
<h3 id="org82ee495"><span class="section-number-3">5.2.</span> Programmming Language Foundations</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org05c45b4" class="outline-4">
<h4 id="org05c45b4">Program equivalence</h4>
</div>

<div id="outline-container-orga2c6db5" class="outline-4">
<h4 id="orga2c6db5">Hoare logic part 1</h4>
</div>

<div id="outline-container-orgda33304" class="outline-4">
<h4 id="orgda33304">Hoare as a logic</h4>
</div>

<div id="outline-container-org3737434" class="outline-4">
<h4 id="org3737434">Hoare logic part 2</h4>
</div>
</div>
<div id="outline-container-org8a697ed" class="outline-3">
<h3 id="org8a697ed"><span class="section-number-3">5.3.</span> Verified Functional Algorithms</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org1962483" class="outline-4">
<h4 id="org1962483">Permutations and ordering</h4>
</div>

<div id="outline-container-orge47b348" class="outline-4">
<h4 id="orge47b348">Insertion Sort</h4>
</div>

<div id="outline-container-org19affc1" class="outline-4">
<h4 id="org19affc1">Merge Sort</h4>
</div>

<div id="outline-container-org26d4086" class="outline-4">
<h4 id="org26d4086">Selection Sort</h4>
</div>

<div id="outline-container-orgd494c88" class="outline-4">
<h4 id="orgd494c88">Total and partial maps</h4>
</div>

<div id="outline-container-orgebe5323" class="outline-4">
<h4 id="orgebe5323">SearchTrees</h4>
</div>

<div id="outline-container-orgb10ef28" class="outline-4">
<h4 id="orgb10ef28">Abstract Data Types</h4>
</div>

<div id="outline-container-orgd0a1aa5" class="outline-4">
<h4 id="orgd0a1aa5">Running Coq programs in ML</h4>
</div>

<div id="outline-container-org372b487" class="outline-4">
<h4 id="org372b487">Decision procedures</h4>
</div>

<div id="outline-container-org12652f8" class="outline-4">
<h4 id="org12652f8">Multisets</h4>
</div>
</div>
<div id="outline-container-org5a58040" class="outline-3">
<h3 id="org5a58040"><span class="section-number-3">5.4.</span> Intermediate Coq</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org762c338" class="outline-4">
<h4 id="org762c338">Tactic Library for Coq</h4>
</div>
<div id="outline-container-org5e1f268" class="outline-4">
<h4 id="org5e1f268">Theory and Practice of Automation in Coq Proofs</h4>
</div>
<div id="outline-container-orgea1f3a5" class="outline-4">
<h4 id="orgea1f3a5">Handy General Purpose Tactics</h4>
</div>
</div>
<div id="outline-container-orge19aad6" class="outline-3">
<h3 id="orge19aad6"><span class="section-number-3">5.5.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org856612b" class="outline-4">
<h4 id="org856612b">Calculus of Constructions</h4>
</div>
<div id="outline-container-orgb89b361" class="outline-4">
<h4 id="orgb89b361">Other proof assistants</h4>
</div>
<div id="outline-container-orgff016da" class="outline-4">
<h4 id="orgff016da">Separation logic</h4>
</div>
<div id="outline-container-orge7daab1" class="outline-4">
<h4 id="orge7daab1">Property based testing</h4>
</div>
</div>
</div>
<div id="outline-container-orgd25e76b" class="outline-2">
<h2 id="orgd25e76b"><span class="section-number-2">6.</span> Schedule</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Week</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Content</th>
<th scope="col" class="org-left">Notes</th>
<th scope="col" class="org-left">Org Timestamp</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Week 0</td>
<td class="org-left">January 9</td>
<td class="org-left">Intro</td>
<td class="org-left"><a href="sf-notes.html">fn:sf-notes.org</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-09 Thu&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 1</td>
<td class="org-left">January 13</td>
<td class="org-left">LF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-13 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 2</td>
<td class="org-left">January 20</td>
<td class="org-left">LF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-20 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 3</td>
<td class="org-left">January 27</td>
<td class="org-left">LF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-27 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 4</td>
<td class="org-left">February 3</td>
<td class="org-left">LF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-03 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 5</td>
<td class="org-left">February 10</td>
<td class="org-left">LF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-10 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 6</td>
<td class="org-left">February 17</td>
<td class="org-left">LF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-17 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 7</td>
<td class="org-left">February 24</td>
<td class="org-left">Break (LF)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-24 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 8</td>
<td class="org-left">March 3</td>
<td class="org-left">PLF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-03 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 9</td>
<td class="org-left">March 10</td>
<td class="org-left">PLF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-10 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 10</td>
<td class="org-left">March 17</td>
<td class="org-left">PLF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-17 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 11</td>
<td class="org-left">March 24</td>
<td class="org-left">VFA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-24 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 12</td>
<td class="org-left">March 31</td>
<td class="org-left">Break (VFA)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-31 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 13</td>
<td class="org-left">April 7</td>
<td class="org-left">VFA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-07 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 14</td>
<td class="org-left">April 14</td>
<td class="org-left">VFA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-14 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 15</td>
<td class="org-left">April 21</td>
<td class="org-left">VFA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-21 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 16</td>
<td class="org-left">April 28</td>
<td class="org-left">VFA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-28 Mon&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">Week 16</td>
<td class="org-left">May 1</td>
<td class="org-left">Conclusion</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-01 Thu&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org7e0dd4c" class="outline-3">
<h3 id="org7e0dd4c"><span class="section-number-3">6.1.</span> Homework Submission</h3>
<div class="outline-text-3" id="text-6-1">
<p>
If you are using <b>Software Foundations</b> in a course, your instructor may use automatic scripts to help grade your homework assignments. In order for these scripts to work correctly (and ensure that you get full credit for your work!), please be careful to follow these rules:
</p>
</div>
<div id="outline-container-orgf579270" class="outline-4">
<h4 id="orgf579270">Rules for Submission</h4>
<div class="outline-text-4" id="text-orgf579270">
<ul class="org-ul">
<li><b><b>Do not change the names of exercises.</b></b>
<ul class="org-ul">
<li>Otherwise, the grading scripts will be unable to find your solution.</li>
</ul></li>
<li><b><b>Do not delete exercises.</b></b>
<ul class="org-ul">
<li>If you skip an exercise (e.g., because it is marked &ldquo;optional,&rdquo; or because you can&rsquo;t solve it), it is OK to leave a partial proof in your `.v` file.</li>
<li>In this case, please make sure it ends with the keyword `Admitted` (not, for example, `Abort`).</li>
</ul></li>
<li><b><b>It is fine to use additional definitions</b></b> (of helper functions, useful lemmas, etc.) in your solutions.
<ul class="org-ul">
<li>You can put these before the theorem you are asked to prove.</li>
</ul></li>
<li><b><b>Handling Unproved Helper Lemmas</b></b>
<ul class="org-ul">
<li>If you introduce a helper lemma that you are unable to prove and end it with `Admitted`, then make sure to also end the main theorem in which you use it with `Admitted`, not `Qed`.</li>
<li>This will help you get partial credit if you use that main theorem to solve a later exercise.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org776aaf7" class="outline-4">
<h4 id="org776aaf7">Using Test Scripts</h4>
<div class="outline-text-4" id="text-org776aaf7">
<p>
You will also notice that each chapter (like `Basics.v`) is accompanied by a test script (`BasicsTest.v`) that automatically calculates points for the finished homework problems in the chapter. These scripts are mostly for the auto-grading tools, but you may also want to use them to double-check that your file is well formatted before handing it in.
</p>
</div>
</div>
<div id="outline-container-org0f03b18" class="outline-4">
<h4 id="org0f03b18">Testing in the Terminal</h4>
<div class="outline-text-4" id="text-org0f03b18">
<p>
In a terminal window, either type:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #78DCE8;">make</span> BasicsTest.vo
</pre>
</div>

<p>
Or, do the following:
</p>
<div class="org-src-container">
<pre class="src src-shell">coqc -Q . LF Basics.v
coqc -Q . LF BasicsTest.v
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org506bd62" class="outline-2">
<h2 id="org506bd62"><span class="section-number-2">7.</span> Directory</h2>
<div class="outline-text-2" id="text-7">
<p>
Each directory contains .v files and .html files. The important ones in each directory are:
</p>
</div>
<div id="outline-container-org5673a63" class="outline-4">
<h4 id="org5673a63">Preface.v or Preface.html</h4>
<div class="outline-text-4" id="text-org5673a63">
<p>
The place to start reading, including details on how to install required software
</p>
</div>
</div>
<div id="outline-container-org0bbf040" class="outline-4">
<h4 id="org0bbf040">index.html</h4>
<div class="outline-text-4" id="text-org0bbf040">
<p>
The book&rsquo;s cover page and navigation starting point
</p>
</div>
</div>
<div id="outline-container-orgdb35674" class="outline-4">
<h4 id="orgdb35674">deps.html</h4>
<div class="outline-text-4" id="text-orgdb35674">
<p>
Overview of the ordering of chapters
</p>
</div>
</div>
</div>
<div id="outline-container-orge87de75" class="outline-2">
<h2 id="orge87de75"><span class="section-number-2">8.</span> Health and Wellbeing</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgdc11d3a" class="outline-4">
<h4 id="orgdc11d3a">The student is required to prioritize their wellbeing and seek assistance if problems are encountered. :)</h4>
</div>
</div>
<div id="outline-container-org4114446" class="outline-2">
<h2 id="org4114446"><span class="section-number-2">9.</span> Documentation</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgcaf17ec" class="outline-4">
<h4 id="orgcaf17ec"><span class="todo TODO">TODO</span> open github repo</h4>
</div>
<div id="outline-container-org2285f38" class="outline-4">
<h4 id="org2285f38"><span class="todo TODO">TODO</span> display commit message in the top of the webpage</h4>
</div>
<div id="outline-container-org21be0e9" class="outline-4">
<h4 id="org21be0e9"><span class="todo TODO">TODO</span> crontab fetch pull rebase  - auto updating for professor and I</h4>
</div>
<div id="outline-container-orgbb58513" class="outline-4">
<h4 id="orgbb58513"><span class="todo TODO">TODO</span> agree on a workflow for commenting on the document</h4>
</div>
<div id="outline-container-org71a5bc9" class="outline-4">
<h4 id="org71a5bc9"><span class="todo TODO">TODO</span> create discord group, with discord-github notifications</h4>
</div>
<div id="outline-container-orgb4ca043" class="outline-4">
<h4 id="orgb4ca043"><span class="todo TODO">TODO</span> separate each large heading to its own page with backbuttons to TOC</h4>
</div>
<div id="outline-container-org67c7507" class="outline-4">
<h4 id="org67c7507"><span class="todo TODO">TODO</span> spacing issues</h4>
</div>
<div id="outline-container-org5436a40" class="outline-4">
<h4 id="org5436a40"><span class="todo TODO">TODO</span> typography. embed iosevka font</h4>
</div>
<div id="outline-container-org15725bc" class="outline-4">
<h4 id="org15725bc"><span class="todo TODO">TODO</span> links to attached sf book</h4>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-01-08 Wed 20:44</p>
</div>
</body>
</html>
